antoine163/Digital-Shelf-Clock/Info/nucleo-g071rb/mpLib/portable/stm32g0xx/mp_uart_port.c
        // Save pointer of usart device.
        _mp_uart_port_usart1_dev = dev;
        
        // Set TX/RX direction
        LL_LPUART_SetTransferDirection(USART1, transferDirection);
        
        #ifdef MP_USART1_RX_PIN_LEVEL
        LL_USART_SetRXPinLevel(USART1, MP_USART1_RX_PIN_LEVEL);
        #endif
        
        #ifdef MP_USART1_TX_PIN_LEVEL
        LL_USART_SetTXPinLevel(USART1, MP_USART1_TX_PIN_LEVEL);
        #endif
        
        //#ifdef MP_USART1_RX_GPIO_Port
        //// Enable RXNE and Error interrupts.
        //LL_USART_EnableIT_RXNE_RXFNE(USART1);
        //#endif
        
        return 0;
    }
    #endif
    
    // USART2
    // =================================
    #if defined(MP_USART2_RX_GPIO_Port) || defined(MP_USART2_TX_GPIO_Port)
    #ifndef USART2
    #error "MP_USART2_*** is defined in mpHardMap.h but the USART2 is not available on your stm32g0 !"
    #endif
    if (uartx == USART2)
    {
        uint32_t transferDirection = LL_LPUART_DIRECTION_NONE;
        
        #ifdef MP_USART2_RX_GPIO_Port
            transferDirection |= LL_LPUART_DIRECTION_RX;
            
            // Configure RX Pin as : Alternate function
            LL_GPIO_SetPinMode(         MP_USART2_RX_GPIO_Port, MP_USART2_RX_Pin, LL_GPIO_MODE_ALTERNATE);
            if(MP_USART2_RX_Pin <= LL_GPIO_PIN_7)
                LL_GPIO_SetAFPin_0_7(   MP_USART2_RX_GPIO_Port, MP_USART2_RX_Pin, MP_USART2_RX_AF);
            else
                LL_GPIO_SetAFPin_8_15(  MP_USART2_RX_GPIO_Port, MP_USART2_RX_Pin, MP_USART2_RX_AF);
            LL_GPIO_SetPinSpeed(        MP_USART2_RX_GPIO_Port, MP_USART2_RX_Pin, MP_USART2_RX_SPEED);
            LL_GPIO_SetPinPull(         MP_USART2_RX_GPIO_Port, MP_USART2_RX_Pin, MP_USART2_RX_PULL);
            
            // Init Rx FiFo
            static mp_fifo_t uart2FifoRx;
            static uint8_t uart2FifoRxStorageBuffer[MP_USART2_RX_FIFO_SIZE];
            mp_fifo_init(&uart2FifoRx, uart2FifoRxStorageBuffer, MP_USART2_RX_FIFO_SIZE);
            dev->fifoRx = &uart2FifoRx;
        #endif
        
        #ifdef MP_USART2_TX_GPIO_Port
            transferDirection |= LL_LPUART_DIRECTION_TX;
            
            // Configure TX Pin as : Alternate function
            LL_GPIO_SetPinMode(         MP_USART2_TX_GPIO_Port, MP_USART2_TX_Pin, LL_GPIO_MODE_ALTERNATE);
            if(MP_USART2_TX_Pin <= LL_GPIO_PIN_7)
                LL_GPIO_SetAFPin_0_7(   MP_USART2_TX_GPIO_Port, MP_USART2_TX_Pin, MP_USART2_TX_AF);
            else
                LL_GPIO_SetAFPin_8_15(  MP_USART2_TX_GPIO_Port, MP_USART2_TX_Pin, MP_USART2_TX_AF);
            LL_GPIO_SetPinSpeed(        MP_USART2_TX_GPIO_Port, MP_USART2_TX_Pin, MP_USART2_TX_SPEED);
            LL_GPIO_SetPinOutputType(   MP_USART2_TX_GPIO_Port, MP_USART2_TX_Pin, MP_USART2_TX_OUTPUT);
            LL_GPIO_SetPinPull(         MP_USART2_TX_GPIO_Port, MP_USART2_TX_Pin, MP_USART2_TX_PULL);
            
            // Init Tx FiFo
            static mp_fifo_t uart2FifoTx;
            static uint8_t uart2FifoTxStorageBuffer[MP_USART2_TX_FIFO_SIZE];
            mp_fifo_init(&uart2FifoTx, uart2FifoTxStorageBuffer, MP_USART2_TX_FIFO_SIZE);
            dev->fifoTx = &uart2FifoTx;
        #endif
        
        // Enable the USART2 peripheral clock and clock source.
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);
        
        // Set USART2 clock source as PCLK1
        LL_RCC_SetUSARTClockSource(MP_USART2_CLKSOURCE);
        
        // Save pointer of usart device.
        _mp_uart_port_usart2_dev = dev;
        
        // Set TX/RX direction
        LL_LPUART_SetTransferDirection(USART2, transferDirection);
        
        #ifdef MP_USART2_RX_PIN_LEVEL
        LL_USART_SetRXPinLevel(USART2, MP_USART2_RX_PIN_LEVEL);
        #endif
        
        #ifdef MP_USART2_TX_PIN_LEVEL
        LL_USART_SetTXPinLevel(USART2, MP_USART2_TX_PIN_LEVEL);
        #endif
        
        #ifdef MP_USART2_RX_GPIO_Port
        // Enable RX FIFO Full Interrupt
        LL_USART_EnableIT_RXFF(USART2);
        #endif
        
        return 0;
    }
    #endif
    
    return -1;
}

int mp_uart_port_deinit(mp_device_id_t devid)
{
    mp_uart_port_t * dev = MP_PORT_UART_GET(devid);
    USART_TypeDef * uartx = dev->uartx;
    
    // Disable RXNE and Error interrupts.
    LL_USART_DisableIT_RXNE_RXFNE(uartx);
    
    // Disable usart
    LL_LPUART_Disable(uartx);
    
    // USART1
    // =================================
    #if defined(USART1_RX_GPIO_Port) || defined(USART1_TX_GPIO_Port)
    if(uartx == USART1)
    {
        // Remove pointer of usart device.
        _mp_uart_port_usart1_dev = NULL;
        
        // Disable the USART1 peripheral clock and clock source.
        LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_USART1);
        
        #ifdef USART1_RX_GPIO_Port
            // Configure RX Pin as : Analog input.
            LL_GPIO_SetPinMode(     USART1_RX_GPIO_Port, USART1_RX_Pin, LL_GPIO_MODE_ANALOG);
            LL_GPIO_SetPinSpeed(    USART1_RX_GPIO_Port, USART1_RX_Pin, LL_GPIO_SPEED_FREQ_MEDIUM);
            LL_GPIO_SetPinPull(     USART1_RX_GPIO_Port, USART1_RX_Pin, LL_GPIO_PULL_NO);
        #endif
        
        #ifdef USART1_TX_GPIO_Port
            // Configure TX Pin as : Analog input.
            LL_GPIO_SetPinMode(     USART1_TX_GPIO_Port, USART1_TX_Pin, LL_GPIO_MODE_ANALOG);
            LL_GPIO_SetPinSpeed(    USART1_TX_GPIO_Port, USART1_TX_Pin, LL_GPIO_SPEED_FREQ_MEDIUM);
            LL_GPIO_SetPinPull(     USART1_TX_GPIO_Port, USART1_TX_Pin, LL_GPIO_PULL_NO);
        #endif
        
        return 0;
    }
    #endif
    
    // USART2
    // =================================
    #if defined(USART2_RX_GPIO_Port) || defined(USART2_TX_GPIO_Port)
    if(uartx == USART2)
    {
        // Remove pointer of usart device.
        _mp_uart_port_usart2_dev = NULL;
        
        // Disable the USART2 peripheral clock and clock source.
        LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART2);
        
        #ifdef USART2_RX_GPIO_Port
            // Configure RX Pin as : Analog input.
            LL_GPIO_SetPinMode(     USART2_RX_GPIO_Port, USART2_RX_Pin, LL_GPIO_MODE_ANALOG);
            LL_GPIO_SetPinSpeed(    USART2_RX_GPIO_Port, USART2_RX_Pin, LL_GPIO_SPEED_FREQ_MEDIUM);
            LL_GPIO_SetPinPull(     USART2_RX_GPIO_Port, USART2_RX_Pin, LL_GPIO_PULL_NO);
        #endif
        
        #ifdef USART2_TX_GPIO_Port
            // Configure TX Pin as : Analog input.
            LL_GPIO_SetPinMode(     USART2_TX_GPIO_Port, USART2_TX_Pin, LL_GPIO_MODE_ANALOG);
            LL_GPIO_SetPinSpeed(    USART2_TX_GPIO_Port, USART2_TX_Pin, LL_GPIO_SPEED_FREQ_MEDIUM);
            LL_GPIO_SetPinPull(     USART2_TX_GPIO_Port, USART2_TX_Pin, LL_GPIO_PULL_NO);
        #endif
        
