antoine163/Digital-Shelf-Clock/Info/nucleo-g071rb/mpLib/portable/stm32g0xx/mp_uart_port.c
        return 0;
    }
    #endif
    
    return -1;
}

// Note: pas de pariter en databit=9
// Note: la vertion 9bit non suporter par ce driver mais pouret étre implmenter ...
int mp_uart_port_config(mp_device_id_t devid, mp_uart_baudrate_t baudrate,
                        mp_uart_databits_t databit, mp_uart_parity_t parity,
                        mp_uart_stopbit_t stopbit)
{
    // Todo: fair des asserts
    //// Check databit compatibility
    //mp_assert(  (databit == MP_UART_DATA_7BITS) ||
                //(databit == MP_UART_DATA_8BITS) ||
                //(databit == MP_UART_DATA_9BITS), "Length data bits is not sported")
    
    //// Check stopbit compatibility
    //mp_assert(  (stopbit == MP_UART_STOPBIT_0_5) ||
                //(stopbit == MP_UART_STOPBIT_1)   ||
                //(stopbit == MP_UART_STOPBIT_1_5) ||
                //(stopbit == MP_UART_STOPBIT_2), "Stop Bit not sported")
    
    //// Check stopbit compatibility
    //mp_assert(  (databit != MP_UART_DATA_9BITS) ||
                //(databit == MP_UART_DATA_9BITS) &&
                //(parity == MP_UART_PARITY_NO), "Stop Bit not sported")
    
    
    
    USART_TypeDef * uartx = MP_PORT_UART_GET(devid)->uartx;
    
    
    
    uint32_t DataWidth;
    switch(databit)
    {
        case MP_UART_DATA_7BITS: DataWidth = LL_USART_DATAWIDTH_7B; break;
        case MP_UART_DATA_8BITS: DataWidth = LL_USART_DATAWIDTH_8B; break;
        //case MP_UART_DATA_9BITS: DataWidth = LL_USART_DATAWIDTH_9B; break;
        default: return -1;
    }
    
    uint32_t Parity;
    switch(parity)
    {
        case MP_UART_PARITY_NO:   Parity = LL_USART_PARITY_NONE; break;
        case MP_UART_PARITY_ODD:  Parity = LL_USART_PARITY_ODD;  break;
        case MP_UART_PARITY_EVEN: Parity = LL_USART_PARITY_EVEN; break;
        default: return -1;
    }
    
    uint32_t StopBits;
    switch(stopbit)
    {
        case MP_UART_STOPBIT_0_5: StopBits = LL_USART_STOPBITS_0_5; break;
        case MP_UART_STOPBIT_1:   StopBits = LL_USART_STOPBITS_1;   break;
        case MP_UART_STOPBIT_1_5: StopBits = LL_USART_STOPBITS_1_5; break;
        case MP_UART_STOPBIT_2:   StopBits = LL_USART_STOPBITS_2;   break;
        default: return -1;
    }
    
    /* (4) Configure USART functional parameters ********************************/
    
    /* Disable USART prior modifying configuration registers */
    /* Note: Commented as corresponding to Reset value */
     LL_USART_Disable(uartx);
    
    /* TX/RX direction */
    //LL_USART_SetTransferDirection(uartx, LL_USART_DIRECTION_TX_RX);
    //LL_USART_SetTransferDirection(uartx, LL_USART_DIRECTION_TX);
    
    /* 8 data bit, 1 start bit, 1 stop bit, no parity */
    LL_USART_ConfigCharacter(uartx, DataWidth, Parity, StopBits);
    
    /* Oversampling by 16 */
    /* Reset value is LL_USART_OVERSAMPLING_16 */
    // LL_USART_SetOverSampling(uartx, LL_USART_OVERSAMPLING_16);
     LL_USART_SetOverSampling(uartx, LL_USART_OVERSAMPLING_8);
    
    /* Set Baudrate to 115200 using APB frequency set to 56000000 Hz */
    /* Frequency available for USART peripheral can also be calculated through LL RCC macro */
    /* Ex :
        Periphclk = LL_RCC_GetUSARTClockFreq(Instance); or LL_RCC_GetUARTClockFreq(Instance); depending on USART/UART instance
    
        In this example, Peripheral Clock is expected to be equal to 56000000 Hz => equal to SystemCoreClock
    */
    LL_USART_SetBaudRate(uartx, SystemCoreClock, LL_USART_PRESCALER_DIV1, LL_USART_OVERSAMPLING_8, (uint32_t)baudrate); 
    //LL_USART_SetBaudRate(uartx, SystemCoreClock, LL_USART_PRESCALER_DIV1, LL_USART_OVERSAMPLING_16, (uint32_t)baudrate); 
    // Todo activer ou pas LL_USART_OVERSAMPLING_16
    
    // Enable a FiFo mode is the USART is compatible.
    if (IS_UART_FIFO_INSTANCE(uartx))
        LL_USART_EnableFIFO(uartx);
    
    /* (5) Enable USART *********************************************************/
    LL_USART_Enable(uartx);
    
    /* Polling USART initialisation */
    //while ((!(LL_USART_IsActiveFlag_TEACK(uartx))) || (!(LL_USART_IsActiveFlag_REACK(uartx))))
    //while ( !LL_USART_IsActiveFlag_TEACK(uartx) );
    
    return 0;
}

// Ecrit dans la fifo Tx temp qu'il y a des donner dans le buffer (@p buf) et que le
// timeout n'est pas ecouler.
// Note: Le time out est recharger a chaque foi qu'un octer peut étre ecri dans la fifo Tx
ssize_t mp_uart_port_write(mp_device_id_t devid, const void * buf, size_t nbyte, mp_tick_t timeout)
{
    mp_uart_port_t * dev = MP_PORT_UART_GET(devid);
    USART_TypeDef * uartx = dev->uartx;
    size_t n = 0;
    
    // No byte to send ?
    if (nbyte == 0)
        return 0;
    
    // Mask of CR1 to disable and enable interruption to push data in the
    // Tx FiFo safely. The interruption used depend the uart mode, in Fifo mode
    // or not. 
    uint32_t cr1ItMask = 0;
    if (LL_USART_IsEnabledFIFO(uartx))
    {
        // In USART FiFo mode the 'TX FIFO Empty Interrupt' flag is used to
        // manage the transition and limit the number of interruption.
        // See: mp_uart_port_usartx_fifo_isr().
        cr1ItMask = USART_CR1_TXFEIE;
    }
    else
    {
        // In USART standard mode the 'TX Empty' flag is used to manage the
        // transition. See mp_uart_port_usartx_isr().
        cr1ItMask = USART_CR1_TXEIE_TXFNFIE;
    }
        
    // Write all data until complete or timeout.
    do
    {
    #if defined MP_USE_FREERTOS
//TODO fair le mise au propre !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
        // Initialism xTimeOut to manager timeout
        TimeOut_t xTimeOut;
        vTaskSetTimeOutState( &xTimeOut );
        
        
        dev->notify = MP_UART_PORT_NOTIFY_TXFIFO_NO_FULL;
    
        // Wait free byte in a FiFo or quit if timeout.
        while (mp_fifo_isFull(dev->fifoTx))
        {
            if (xTaskCheckForTimeOut( &xTimeOut, &timeout ) == pdTRUE)
            {
                dev->notify = MP_UART_PORT_NOTIFY_NONE;
                return n;
            }
            
            ulTaskNotifyTakeIndexed(MP_DEVICE_ID(MP_DEVICE(dev)->devid), pdTRUE, timeout);
            //__NOP();
        }
        
