antoine163/Digital-Shelf-Clock/Info/nucleo-g071rb/mpLib/portable/stm32g0xx/mp_uart_port.c
        dev->notify = MP_UART_PORT_NOTIFY_NONE;
    #else
        // Get time to manager timeout
        mp_tick_t tickStart = mp_tick_get();
    
        // Wait free byte in a FiFo or quit if timeout.
        while (mp_fifo_isFull(dev->fifoTx))
        {
            if (mp_tick_get() - tickStart >= timeout)
                return n;
            
            __WFI();
        }
    #endif
        
        // Push data to FiFo
        ATOMIC_CLEAR_BIT(uartx->CR1, cr1ItMask); 
        n += mp_fifo_push(dev->fifoTx, buf+n, nbyte-n);
        ATOMIC_SET_BIT(uartx->CR1, cr1ItMask);
        
    }while (n < nbyte);

    return n;
}

// Si il n'y pas pas de donnée de disponible attem au maximume un timout.
// Li les donner de la fifo de nbyte ou moin. si aucune donnée est displonible 
// a laplle de la fonction atten au maximume un timeout.
// Note: Le time out commense a lapelle de la fonction
ssize_t mp_uart_port_read(mp_device_id_t devid, void * buf, size_t nbyte, mp_tick_t timeout)
{
    mp_uart_port_t * dev = MP_PORT_UART_GET(devid);
    USART_TypeDef * uartx = dev->uartx;
    size_t n = 0;
    
    // No byte to receive ?
    if (nbyte == 0)
        return 0;

    // Wait available byte or timeout
    if (mp_uart_port_waitDataReceive(devid, timeout) <= 0)
        return 0;

    // Mask of CR1 to disable and enable interruption to pop data in the
    // Rx FiFo safely. The interruption used depend the uart mode, in Fifo mode
    // or not. 
    uint32_t cr1ItMask = 0;
    if (LL_USART_IsEnabledFIFO(uartx))
    {
        // In USART FiFo mode the 'RX FIFO Full Interrupt' flag is used to
        // manage the reception and limit the number of interruption.
        // See: mp_uart_port_usartx_fifo_isr().
        cr1ItMask = USART_CR1_RXFFIE;
    }
    else
    {
        // In USART standard mode the 'RX Not Empty' flag is used to manage the
        // reception. See mp_uart_port_usartx_isr().
        cr1ItMask = USART_CR1_RXNEIE_RXFNEIE;
    }

    // Disable 'RX FIFO Full Interrupt' or 'RX Not Empty'
    ATOMIC_CLEAR_BIT(uartx->CR1, cr1ItMask); 
    
    // Tack bytes from Rx FiFo
    n += mp_fifo_pop(dev->fifoRx, buf+n, nbyte-n);
    
    // Tack additional bytes from USART Rx
    while(  (n < nbyte) &&
            LL_USART_IsActiveFlag_RXNE_RXFNE(uartx))
    {
        uint8_t byte = LL_USART_ReceiveData8(uartx);
        *((uint8_t*)buf + n) = byte;
        n += 1;
    }
    
    // Enable 'RX FIFO Full Interrupt' or 'RX Not Empty'
    ATOMIC_SET_BIT(uartx->CR1, cr1ItMask);
    
    return n;
}


int mp_uart_port_waitEndTransmit(mp_device_id_t devid, mp_tick_t timeout)
{
    mp_uart_port_t * dev = MP_PORT_UART_GET(devid);
    USART_TypeDef * uartx = dev->uartx;
    
#if defined MP_USE_FREERTOS
//TODO fair le mise au propre !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    // Initialism xTimeOut to manager timeout
    TimeOut_t xTimeOut;
    vTaskSetTimeOutState( &xTimeOut );
    
    LL_USART_EnableIT_TC(uartx);
    dev->notify = MP_UART_PORT_NOTIFY_TXFIFO_EMPTY;
    
    
    // Wait free byte in a FiFo or quit if timeout.
    while(!LL_USART_IsActiveFlag_TC(uartx))
    {
        if (xTaskCheckForTimeOut( &xTimeOut, &timeout ) == pdTRUE)
        {
            dev->notify = MP_UART_PORT_NOTIFY_NONE;
            return 0;
        }
        
        ulTaskNotifyTakeIndexed(MP_DEVICE_ID(MP_DEVICE(dev)->devid), pdTRUE, timeout);
        //__NOP();
    }
    
    dev->notify = MP_UART_PORT_NOTIFY_NONE;
#else
    // Get initial time to manager timeout
    mp_tick_t tickStart = mp_tick_get();
    
    // Enable 'transmission complete interrupt' to wakeup the CPU when the
    // last byte as transferred.
    LL_USART_EnableIT_TC(uartx);
    
    // Wait the Transmission Complete flag or timeout
    while(!LL_USART_IsActiveFlag_TC(uartx))
    {
        if (mp_tick_get() - tickStart >= timeout)
            return 0;
            
        __WFI();
    }
#endif

    return 1;
}

int mp_uart_port_waitDataReceive(mp_device_id_t devid, mp_tick_t timeout)
{
    mp_uart_port_t * dev = MP_PORT_UART_GET(devid);
    USART_TypeDef * uartx = dev->uartx;
    
#if defined MP_USE_FREERTOS
//TODO fair le mise au propre !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    // Initialism xTimeOut to manager timeout
    TimeOut_t xTimeOut;
    vTaskSetTimeOutState( &xTimeOut );
    
    
    
    LL_USART_EnableIT_RXNE_RXFNE(uartx);
    dev->notify = MP_UART_PORT_NOTIFY_RXFIFO_NO_EMPTY;
    
    // Wait free byte in a FiFo or quit if timeout.
    while(mp_fifo_isEmpty(dev->fifoRx))
    {
        if (xTaskCheckForTimeOut( &xTimeOut, &timeout ) == pdTRUE)
        {
            dev->notify = MP_UART_PORT_NOTIFY_NONE;
            return 0;
        }
        
        ulTaskNotifyTakeIndexed(MP_DEVICE_ID(MP_DEVICE(dev)->devid), pdTRUE, timeout);
        //__NOP();
    }
    
    dev->notify = MP_UART_PORT_NOTIFY_NONE;
#else
    // No byte available in Rx FiFo ?
    if (mp_fifo_isEmpty(dev->fifoRx))
    {
        // Get initial time to manager timeout
        mp_tick_t tickStart = mp_tick_get();
    
        // Enable RX Not Empty and RX FIFO Not Empty Interrupt to wakeup the
        // CPU when the a byte as receive.
        LL_USART_EnableIT_RXNE_RXFNE(uartx);
    
        // Wait available byte or timeout.
        while(mp_fifo_isEmpty(dev->fifoRx))
        {
            if (mp_tick_get() - tickStart >= timeout)
                return 0;
                
            __WFI();
        }
    }
#endif

    return mp_fifo_used(dev->fifoRx);
}

int mp_uart_port_ctl(mp_device_id_t devid, int request, va_list ap)
{
    (void)devid;
    (void)request;
    (void)ap;
    
    
    int ret = 0;
    switch(request)
    {
        // Todo: mp_assert() ou mp_err plustot que de retrouner -1
        default: ret = -1; break;
        //default: mp_err("The request=%u to control uart is not sported", request); break;
    }
    
    return ret;
}
